# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
serie1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
serie2 = pd.Series(np.random.randint(1, high=4, size= 100, dtype='l'))
serie3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))
print(serie1)
print(serie2)
print(serie3)

0     2
1     4
2     1
3     3
4     2
     ..
95    2
96    1
97    1
98    1
99    4
Length: 100, dtype: int32
0     2
1     1
2     2
3     2
4     3
     ..
95    1
96    2
97    3
98    1
99    1
Length: 100, dtype: int32
0     18073
1     14549
2     18285
3     20213
4     10871
      ...
95    18792
96    18602
97    11000
98    11199
99    27251
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.concat([serie1,serie2,serie3], axis=1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.rename(columns={0 : "bedrs", 1 : "bathrs", 2 : "price_sqr_meter"}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            18073
1      4       1            14549
2      1       2            18285
3      3       2            20213
4      2       3            10871

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.concat([serie1,serie2,serie3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))
bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       4
2       1
3       3
4       2
..    ...
95  18792
96  18602
97  11000
98  11199
99  27251

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [6]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [7]:
bigcolumn.reset_index(drop=True,  inplace=True)
bigcolumn

         0
0        2
1        4
2        1
3        3
4        2
..     ...
295  18792
296  18602
297  11000
298  11199
299  27251

[300 rows x 1 columns]